# Apple Stock

### Introduction:

We are going to use Apple's stock price.


### Step 1. Import the necessary libraries (pandas,numpy, matplotlib etc)

In [1]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Time_Series/Apple_Stock/appl_1980_2014.csv) or from the file appl_1980_2014.csv from the datasets folder.

In [2]:
df = pd.read_csv('C:/Users/Sai Sahishnu/Downloads/apple.csv')
df

           date   close         volume    open      high       low
0         16:00  192.23     46,541,444  191.72  197.1800  191.4501
1    2018/11/13  192.23  46725710.0000  191.63  197.1800  191.4501
2    2018/11/12  194.17  50991030.0000  199.00  199.8500  193.7900
3    2018/11/09  204.47  34317760.0000  205.55  206.0100  202.2500
4    2018/11/08  208.49  25289270.0000  209.98  210.1200  206.7500
..          ...     ...            ...     ...       ...       ...
249  2017/11/17  170.15  21884010.0000  171.04  171.3900  169.6400
250  2017/11/16  171.10  23598650.0000  171.18  171.8700  170.3000
251  2017/11/15  169.08  28998220.0000  169.97  170.3197  168.3800
252  2017/11/14  171.34  24683350.0000  173.04  173.4800  171.1800
253  2017/11/13  173.97  16956290.0000  173.50  174.5000  173.4000

[254 rows x 6 columns]

### Step 3. Assign it to a variable apple

In [3]:
apple = df
apple

           date   close         volume    open      high       low
0         16:00  192.23     46,541,444  191.72  197.1800  191.4501
1    2018/11/13  192.23  46725710.0000  191.63  197.1800  191.4501
2    2018/11/12  194.17  50991030.0000  199.00  199.8500  193.7900
3    2018/11/09  204.47  34317760.0000  205.55  206.0100  202.2500
4    2018/11/08  208.49  25289270.0000  209.98  210.1200  206.7500
..          ...     ...            ...     ...       ...       ...
249  2017/11/17  170.15  21884010.0000  171.04  171.3900  169.6400
250  2017/11/16  171.10  23598650.0000  171.18  171.8700  170.3000
251  2017/11/15  169.08  28998220.0000  169.97  170.3197  168.3800
252  2017/11/14  171.34  24683350.0000  173.04  173.4800  171.1800
253  2017/11/13  173.97  16956290.0000  173.50  174.5000  173.4000

[254 rows x 6 columns]

### Step 4.  Check out the type of the columns

In [35]:
apple.info()

<class 'pandas.core.frame.DataFrame'>
Index: 254 entries, 16:00 to 2017/11/13
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   close   254 non-null    float64
 1   volume  254 non-null    object
 2   open    254 non-null    float64
 3   high    254 non-null    float64
 4   low     254 non-null    float64
dtypes: float64(4), object(1)
memory usage: 11.9+ KB

### Step 5. Transform the Date column as a datetime type

In [4]:
apple['Date'] = pd.to_datetime(apple.date,infer_datetime_format = True)
apple

,date,close,volume,open,high,low,Date
0,16:00,192.23,"46,541,444",191.72,197.1800,191.4501,2021-04-22 16:00:00
1,2018/11/13,192.23,46725710.0000,191.63,197.1800,191.4501,2018-11-13 00:00:00
2,2018/11/12,194.17,50991030.0000,199.00,199.8500,193.7900,2018-11-12 00:00:00
3,2018/11/09,204.47,34317760.0000,205.55,206.0100,202.2500,2018-11-09 00:00:00
4,2018/11/08,208.49,25289270.0000,209.98,210.1200,206.7500,2018-11-08 00:00:00
...,...,...,...,...,...,...,...
249,2017/11/17,170.15,21884010.0000,171.04,171.3900,169.6400,2017-11-17 00:00:00
250,2017/11/16,171.10,23598650.0000,171.18,171.8700,170.3000,2017-11-16 00:00:00
251,2017/11/15,169.08,28998220.0000,169.97,170.3197,168.3800,2017-11-15 00:00:00
252,2017/11/14,171.34,24683350.0000,173.04,173.4800,171.1800,2017-11-14 00:00:00
253,2017/11/13,173.97,16956290.0000,173.50,174.5000,173.4000,2017-11-13 00:00:00

### Step 6.  Set the date as the index

In [5]:
apple.set_index('date',inplace = True)
apple.head()

,close,volume,open,high,low,Date
date,,,,,,
16:00,192.23,"46,541,444",191.72,197.18,191.4501,2021-04-22 16:00:00
2018/11/13,192.23,46725710.0000,191.63,197.18,191.4501,2018-11-13 00:00:00
2018/11/12,194.17,50991030.0000,199.00,199.85,193.7900,2018-11-12 00:00:00
2018/11/09,204.47,34317760.0000,205.55,206.01,202.2500,2018-11-09 00:00:00
2018/11/08,208.49,25289270.0000,209.98,210.12,206.7500,2018-11-08 00:00:00

### Step 7.  Is there any duplicate dates?

In [18]:
dupli = apple.Date.nunique()
dupli

254

### Step 8.  The index is from the most recent date. Sort the data so that the first entry is the oldest date.

In [19]:
apple.sort_values('date',ascending = True,inplace = True)
apple

,close,volume,open,high,low,Date
date,,,,,,
16:00,192.23,"46,541,444",191.72,197.1800,191.4501,2021-04-22 16:00:00
2017/11/13,173.97,16956290.0000,173.50,174.5000,173.4000,2017-11-13 00:00:00
2017/11/14,171.34,24683350.0000,173.04,173.4800,171.1800,2017-11-14 00:00:00
2017/11/15,169.08,28998220.0000,169.97,170.3197,168.3800,2017-11-15 00:00:00
2017/11/16,171.10,23598650.0000,171.18,171.8700,170.3000,2017-11-16 00:00:00
...,...,...,...,...,...,...
2018/11/07,209.95,33291640.0000,205.97,210.0600,204.1300,2018-11-07 00:00:00
2018/11/08,208.49,25289270.0000,209.98,210.1200,206.7500,2018-11-08 00:00:00
2018/11/09,204.47,34317760.0000,205.55,206.0100,202.2500,2018-11-09 00:00:00
2018/11/12,194.17,50991030.0000,199.00,199.8500,193.7900,2018-11-12 00:00:00
2018/11/13,192.23,46725710.0000,191.63,197.1800,191.4501,2018-11-13 00:00:00

### Step 9. Get the last business day of each month

In [24]:
apple['month'] = pd.DatetimeIndex(apple.Date).month
apple['Date_wo'] = pd.DatetimeIndex(apple.Date).day
apple.groupby('month').agg({'Date_wo':'max'})

       Date_wo
month
1           31
2           28
3           29
4           30
5           31
6           29
7           31
8           31
9           28
10          31
11          30
12          29

### Step 10.  What is the difference in days between the first day and the oldest

In [26]:
difference = apple.Date.max() - apple.Date.min()
difference

Timedelta('1256 days 16:00:00')

### Step 11.  How many months in the data we have?

In [67]:
months_data = apple['month'].count()
months_data

254

### Step 12. Plot the 'Adj Close' value. Set the size of the figure to 13.5 x 9 inches

In [28]:
plt.figsize(figsize = (13.5,9))
plt.hist(apple['Adj Close'])
plt.show()